#+STARTUP: folded indent
#+PROPERTY: header-args:R :results value :colnames yes :rownames yes :session *R:assertr*

* ライブラリの読み込みとバージョンの確認

#+begin_src R :results silent
library(assertr)
library(tidyverse)
#+end_src
\\

- バージョン
#+begin_src R :results output :exports both
packageVersion("assertr")
#+end_src

#+RESULTS:
: [1] ‘2.6’
\\

*** ★★☆ ~chain_start(data)~, ~chain_end(data, success_fun = success_continue, error_fun = error_report)~.

#+begin_src R :results output :exports both
mtcars %>%
   chain_start %>%
   assert(in_set(1, 2, 3, 4), carb) %>%
   assert_rows(rowMeans, within_bounds(0,5), gear:carb) %>%
   verify(nrow(.)==10) %>%
   verify(mpg < 32) %>%
   chain_end
#+end_src

#+RESULTS:
#+begin_example
There are 7 errors across 4 verbs:
 
         verb redux_fn           predicate     column index value
1      assert     <NA>  in_set(1, 2, 3, 4)       carb    30   6.0
2      assert     <NA>  in_set(1, 2, 3, 4)       carb    31   8.0
3 assert_rows rowMeans within_bounds(0, 5) ~gear:carb    30   5.5
4 assert_rows rowMeans within_bounds(0, 5) ~gear:carb    31   6.5
5      verify     <NA>       nrow(.) == 10       <NA>     1    NA
6      verify     <NA>            mpg < 32       <NA>    18    NA
7      verify     <NA>            mpg < 32       <NA>    20    NA

Error: assertr stopped execution
#+end_example
\\

* 実行環境

#+begin_src R :results output :exports both
sessionInfo()
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.1 (2019-07-05)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.3 LTS

Matrix products: default
BLAS:   /usr/lib/x86_64-linux-gnu/blas/libblas.so.3.7.1
LAPACK: /usr/lib/x86_64-linux-gnu/lapack/liblapack.so.3.7.1

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=en_US.UTF-8    
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=en_US.UTF-8   
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
 [1] forcats_0.4.0   stringr_1.4.0   dplyr_0.8.3     purrr_0.3.3    
 [5] readr_1.3.1     tidyr_1.0.0     tibble_2.1.3    ggplot2_3.2.1  
 [9] tidyverse_1.2.1 assertr_2.6    

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.2        cellranger_1.1.0  pillar_1.4.2      compiler_3.6.1   
 [5] prettyunits_1.0.2 progress_1.2.2    rutils_0.0.0.9000 tools_3.6.1      
 [9] zeallot_0.1.0     lubridate_1.7.4   jsonlite_1.6      lifecycle_0.1.0  
[13] nlme_3.1-141      gtable_0.3.0      lattice_0.20-38   pkgconfig_2.0.3  
[17] rlang_0.4.0       cli_1.9.9.9000    rstudioapi_0.10   haven_2.1.1      
[21] withr_2.1.2       xml2_1.2.2        httr_1.4.1        hms_0.5.1        
[25] generics_0.0.2    vctrs_0.2.0       grid_3.6.1        tidyselect_0.2.5 
[29] glue_1.3.1        R6_2.4.0          fansi_0.4.0       readxl_1.3.1     
[33] pacman_0.5.1      modelr_0.1.5      magrittr_1.5      MASS_7.3-51.4    
[37] backports_1.1.5   scales_1.0.0      rvest_0.3.4       assertthat_0.2.1 
[41] colorspace_1.4-1  stringi_1.4.3     lazyeval_0.2.2    munsell_0.5.0    
[45] broom_0.5.2       crayon_1.3.4
#+end_example
\\

